package com.dict;


import java.util.HashMap;
import java.util.Map;

public class DictTest {
    public static void main(String[] args) {
        String dld = "010101,国家行政机关;010102,政府;010211,幼儿园;010221,小学;010222,成人小学;010231,普通初中;010232,职业初中;010233,成人初中;010234,普通高中;010235,成人高中;010236,中等职业学校;010237,工读学校;010241,普通高等学校;010242,成人高等学校;010251,特殊教育;010291,培养研究生的科研机构;010292,民办的其他高等教育机构;010293,中等职业培训机构;010301,综合医院;010302,中医院;010303,中西结合医院;010304,民族医院;010305,专科医院;010306,疗养院、康复中心;010307,城镇街道、社区医院;010308,门诊部、医务室、诊所;010309,妇幼保健所（站）;010310,卫生防疫中心（站）;010311,急救中心;010312,整形美容;010313,药品检验所（室、中心）;010314,动物医院、兽医站;010315,药店、药房;010316,医疗器械;010401,危险品存放站点;010402,油库;010403,天然气、煤气、液化气;010404,剧毒物品存放站点;010405,放射性物品存放站点;010406,民用爆炸物存储点;010499,其他;020101,大型广场;020102,社区广场;020201,KTV;020202,舞厅;020203,迪吧;020204,酒吧;020205,球馆;020206,电玩;020207,棋牌室;020208,娱乐场所-其他;020301,宾馆、饭店（可住宿）;020302,商务会馆;020303,度假型酒店;020304,公寓式酒店;020305,经济型酒店;020306,会议酒店;020307,一般旅馆;020308,度假村;020309,农家院;020401,大型商场、超市;020402,贸易市场;020403,商业点;020404,商铺;020405,商业片区;020501,中式、西式餐厅;020502,中式、西式快餐店;020503,特色小吃店;020504,自助餐厅;020505,茶（艺）馆;020506,食品店;020599,餐饮服务场所-其他;020601,长途汽车站;020602,火车站;020603,航空港;020604,货运站;020605,码头（港口）;020699,交通场所-其他;020701,公园;020702,风景名胜区;020703,游乐园;020704,历史古迹;020705,动物园;020706,植物园;020801,网吧;020802,ISP网络服务供应商;020901,工程建设区域;020902,施工工地;020903,施工作业区;021001,社区调解室;021002,社区警务室;021003,社区综治工作中心;021004,社区流管工作中心;021005,社区连心驿站;021006,派出所;021007,公安局;021101,旅馆;021201,取得快递（物流）业务经营许可证企业;021202,备案分支机构;021299,其他;029999,其他场所";
        String sg = "0,小学;1,幼儿园;2,托管机构;3,中学;4,大专院校;5,成人教育、职高、技校等;6,广播、函授、培训;7,特殊教育;8,电视学校;9,教育-其他;10,国家行政机关;11,政府;12,综合医院;13,中医院;14,中西结合医院;15,民族医院;16,专科医院;17,疗养院、康复中心;18,城镇街道、社区医院;19,门诊部、医务室、诊所;20,妇幼保健所(站);21,卫生防疫中心(站);22,急救中心;23,药品检验所;24,动物医院、兽医站;25,药店、药房;26,医疗器械;98,整形美容;27,危化品存放站点;28,油库;29,天然气、煤气、液化气;30,剧毒物品存放站点;31,放射性物品存放站点;32,民用爆炸物存储点;33,国有企业;34,国有控股企业;35,外资企业;36,合资企业;37,私营企业;38,事业单位;39,单位其他;40,大型广场;41,社区广场;42,长途汽车站;43,火车站;44,航空港;45,货运站;46,码头;47,交通场所其他;48,KTV;49,舞厅;50,迪吧;51,酒吧;52,球馆;53,电玩;54,娱乐场所其他;99,棋牌室;55,大型商场、超市;56,贸易市场;57,商业点;58,商铺;59,商业片区;60,网吧;61,ISP网络服务供应商;62,宾馆、饭店;63,商务会馆;64,度假型酒店;65,公寓式酒店;66,经济型酒店;67,会议酒店;68,一般酒店;69,度假村;70,住宿场所其他;100,农家院;71,中式、西式餐厅;72,中式、西式快餐厅;73,特色小吃站;74,自助餐;75,茶馆;76,食品店;77,餐饮服务场所其他;78,公园;79,风景名胜区;80,游乐园;81,历史古迹;82,动物园;83,植物园;84,工程建设区域;85,施工工地;86,施工作业区;87,寄递点;88,物流点;89,个体场所;90,电镀站;91,化妆品;92,城乡结合部;93,城中村;94,流动人口聚集地;95,出租房屋区;96,矿山市场;97,场所其他";
        String[] sgs = sg.split(";");
        String[] dlds = dld.split(";");
        Map<String,String> sgMap = new HashMap<>();
        Map<String,String> dldMap = new HashMap<>();

        for(String st:dlds){
            String[] s = st.split(",");
            dldMap.put(s[1],s[0]);
        }

        System.out.println("private String set(String key){");
        System.out.println("if (key == null) {return \"\";}");
        System.out.println("        switch (key){");
        for(String st:sgs){
            String[] s = st.split(",");
            String key = dldMap.get(s[1]);
            if(key == null){
                key = "000";
            }
            System.out.println("case \""+ key +"\": return "+s[0]+";         //"+s[1]);
//            System.out.println("case \""+ s[1] +"\": return \""+s[0]+"\";");
        }
        System.out.println("}");
        System.out.println("}");

    }
}
